{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"toc_visible":true,"authorship_tag":"ABX9TyNwHXfbrBRfGnIBfla0Ru5i"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["#Ucentral - NE04J con MONGODB\n","\n","---\n","\n","\n","\n","*   Author:\n","*   Date:\n","*   Description:\n","\n"],"metadata":{"id":"ctMT83IOXKp7"}},{"cell_type":"markdown","source":["# 0.Instalar dependencias\n"],"metadata":{"id":"0vgxyfPaXp5T"}},{"cell_type":"code","execution_count":null,"metadata":{"id":"e8r2Z_yUVjFq"},"outputs":[],"source":["!pip install pymongo neo4j pandas matplotlib seaborn networkx pyvis"]},{"cell_type":"markdown","source":["# 1.Importar librerias"],"metadata":{"id":"McKiecaDX7KC"}},{"cell_type":"code","source":["import pymongo\n","from neo4j import GraphDatabase\n","import pandas as pd\n","import matplotlib.pyplot as plt\n","import seaborn as sns\n","import networkx as nx\n","from pyvis.network import Network\n","from IPython.display import HTML, display\n","from datetime import datetime\n","import warnings\n","warnings.filterwarnings('ignore')"],"metadata":{"id":"JwynEEeNYDhq","executionInfo":{"status":"ok","timestamp":1761261730550,"user_tz":300,"elapsed":1881,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}}},"execution_count":2,"outputs":[]},{"cell_type":"markdown","source":["# 2.Conexión con mongoAtlas y con NEO4J"],"metadata":{"id":"1NKdLNcjYVND"}},{"cell_type":"markdown","source":["## Credenciales"],"metadata":{"id":"gRjHY4stYfbi"}},{"cell_type":"code","source":["#----credenciales para conectarme a mongoAtlas\n","MONGO_URI = \"mongodb+srv://DbCentral:DbCentral2025@cluster0.vhltza7.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0\"\n","MONGO_DB = \"TiquetesViajes\""],"metadata":{"id":"sCc_n8D5Yhf6","executionInfo":{"status":"ok","timestamp":1761261942283,"user_tz":300,"elapsed":3,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}}},"execution_count":4,"outputs":[]},{"cell_type":"code","source":["#----credenciales para conectarme a NE04J\n","NEO4J_URI = \"neo4j+s://3eb02a9d.databases.neo4j.io\"\n","NEO4J_USERNAME = \"neo4j\"\n","NEO4J_PASSWORD = \"ny6PNfdZX_M9dmQD1i3b-VV9FZ2O9x0LIRYzRU8MYGs\"\n","NEO4J_DATABASE = \"neo4j\""],"metadata":{"id":"IiI4XClSYapb","executionInfo":{"status":"ok","timestamp":1761261942939,"user_tz":300,"elapsed":3,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}}},"execution_count":5,"outputs":[]},{"cell_type":"code","source":["# Clase para manejar Neo4j\n","class Neo4jConnection:\n","    def __init__(self, uri, user, password, database):\n","        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n","        self.database = database\n","\n","    def close(self):\n","        self.driver.close()\n","\n","    def query(self, query, parameters=None):\n","        with self.driver.session(database=self.database) as session:\n","            result = session.run(query, parameters)\n","            return [record for record in result]\n","\n","    def execute(self, query, parameters=None):\n","        with self.driver.session(database=self.database) as session:\n","            session.run(query, parameters)"],"metadata":{"id":"yhiW8TYdZOck","executionInfo":{"status":"ok","timestamp":1761262021978,"user_tz":300,"elapsed":8,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}}},"execution_count":6,"outputs":[]},{"cell_type":"markdown","source":["## conectar con mongoAtlas"],"metadata":{"id":"Ol0U26AJaDH6"}},{"cell_type":"code","source":["# Conectar a MongoDB Atlas\n","mongo_client = pymongo.MongoClient(MONGO_URI, serverSelectionTimeoutMS=5000)\n","mongo_db = mongo_client[MONGO_DB]\n","#verificación de la conexión\n","try:\n","    mongo_client.server_info()\n","    print(\"Conexión exitosa a MongoDB Atlas\")\n","except pymongo.errors.ServerSelectionTimeoutError as e:\n","    print(\"Error de conexión a MongoDB Atlas:\", e)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"2TmbkilpZfRT","executionInfo":{"status":"ok","timestamp":1761262112731,"user_tz":300,"elapsed":800,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"2ce777f6-872e-464f-c6ac-21e488bf7e36"},"execution_count":7,"outputs":[{"output_type":"stream","name":"stdout","text":["Conexión exitosa a MongoDB Atlas\n"]}]},{"cell_type":"code","source":["#lista de colecciones de mongo\n","colecciones = mongo_db.list_collection_names()\n","print(colecciones)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"L69RnLXUZ1z7","executionInfo":{"status":"ok","timestamp":1761262158136,"user_tz":300,"elapsed":31,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"671aaec5-762c-4410-b1a2-8c219db4fd3c"},"execution_count":8,"outputs":[{"output_type":"stream","name":"stdout","text":["['Terminal_Barranquilla', 'Terminal_Cartagena', 'Terminal_Medellin', 'Terminal_SantaMarta', 'Terminal_Cali']\n"]}]},{"cell_type":"markdown","source":["## conexión con NEO4J"],"metadata":{"id":"k3KwJUXIaHQZ"}},{"cell_type":"code","source":["neo4j_conn = Neo4jConnection(NEO4J_URI, NEO4J_USERNAME, NEO4J_PASSWORD, NEO4J_DATABASE)"],"metadata":{"id":"8LcjSKG7aKqL","executionInfo":{"status":"ok","timestamp":1761262246173,"user_tz":300,"elapsed":5,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}}},"execution_count":9,"outputs":[]},{"cell_type":"code","source":["#---funcion para limpiar nodos (y relaciones entre ellos ) de la bd de ne04j\n","def limpiar_neo4j():\n","    neo4j_conn.execute(\"MATCH (n) DETACH DELETE n\")\n","    print(\"Base de datos limpia\")"],"metadata":{"id":"1tA-lW2-aTti","executionInfo":{"status":"ok","timestamp":1761262324698,"user_tz":300,"elapsed":47,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}}},"execution_count":10,"outputs":[]},{"cell_type":"code","source":["limpiar_neo4j()"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"iigeQEotalU6","executionInfo":{"status":"ok","timestamp":1761262334946,"user_tz":300,"elapsed":986,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"32873242-58c8-45e0-9688-ee33fcef50dc"},"execution_count":11,"outputs":[{"output_type":"stream","name":"stdout","text":["Base de datos limpia\n"]}]},{"cell_type":"markdown","source":["# 3.cargue de información de mongoAtlas a PANDA(DF)"],"metadata":{"id":"YQa34oelbcSS"}},{"cell_type":"code","source":["datos_totales=[]\n","colecciones_mongo= ['Terminal_Barranquilla', 'Terminal_Cartagena', 'Terminal_Medellin', 'Terminal_SantaMarta', 'Terminal_Cali']\n","for coleccion in colecciones_mongo:\n","  try:\n","    docs =list(mongo_db[coleccion].find({}, {'_id': 0}))\n","    if docs:\n","      datos_totales.extend(docs)\n","    else:\n","      print(f\"No se encontraron documentos en la colección {coleccion}\")\n","  except Exception as e:\n","    print(f\"Error al cargar la colección {coleccion}: {e}\")\n","df= pd.DataFrame(datos_totales)\n","print(f\" total de documentos cargados {len(df)}\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"iNk-L1hYbtQ8","executionInfo":{"status":"ok","timestamp":1761262870063,"user_tz":300,"elapsed":1337,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"ca0217f5-9d99-4930-bf82-4a3f3cd6c430"},"execution_count":12,"outputs":[{"output_type":"stream","name":"stdout","text":[" total de documentos cargados 76253\n"]}]},{"cell_type":"code","source":["def extraer_ciudad_origen(terminal_nombre):\n","  ciudad_map={\n","      \"TERMINAL DE TRANSPORTE DE BARRANQUILLA\":\"BARRANQUILLA\",\n","      \"TERMINAL DE TRANSPORTE DE CARTAGENA\":\"CARTAGENA\",\n","      \"TERMINAL DE TRANSPORTE DE MEDELLIN\":\"MEDELLIN\",\n","      \"TERMINAL DE TRANSPORTE DE SANTA MARTA\":\"SANTA MARTA\",\n","      \"TERMINAL DE TRANSPORTE DE CALI\":\"CALI\"\n","    }\n","  for key, value in ciudad_map.items():\n","    if key in terminal_nombre:\n","      return value\n","  return \"DESCONOCIDA\"\n"],"metadata":{"id":"jOaS4eAkc57L","executionInfo":{"status":"ok","timestamp":1761263776897,"user_tz":300,"elapsed":7,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}}},"execution_count":15,"outputs":[]},{"cell_type":"markdown","source":["# 4.EJERCICIOS"],"metadata":{"id":"9F64R1K_djv8"}},{"cell_type":"markdown","source":["## 4.1 Ejercicio 1: red de rutas entre ciudades\n","\n","---\n","*  Cuales son las ciudades más populares (ciudades destino)?\n","*  Cual o cuales ciudades son los centros de conexión (hub)?\n","*  Grafo de conectividad?\n"],"metadata":{"id":"k4blz-DedpqS"}},{"cell_type":"code","source":["df['ciudad_origen']=df['terminal_nombre'].apply(extraer_ciudad_origen)\n","display(df.head())"],"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":486},"id":"GpQ42-4LehrT","executionInfo":{"status":"ok","timestamp":1761263779349,"user_tz":300,"elapsed":58,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"3904ef41-ad29-4c24-f2f5-d60c33c2dab5"},"execution_count":16,"outputs":[{"output_type":"display_data","data":{"text/plain":["    terminal_nit                         terminal_nombre  ticket_id  \\\n","0  800.123.456-7  TERMINAL DE TRANSPORTE DE BARRANQUILLA   79864565   \n","1  800.123.456-7  TERMINAL DE TRANSPORTE DE BARRANQUILLA  154754628   \n","2  800.123.456-7  TERMINAL DE TRANSPORTE DE BARRANQUILLA  171325877   \n","3  800.123.456-7  TERMINAL DE TRANSPORTE DE BARRANQUILLA  391438653   \n","4  800.123.456-7  TERMINAL DE TRANSPORTE DE BARRANQUILLA  411640288   \n","\n","  ticket_tipo          fecha_venta              empresa  vehiculo  puesto  \\\n","0  PRESENCIAL  2023-10-20 09:34:54  EXPRESO BOLIVARIANO  MICROBUS       7   \n","1    INTERNET  2024-10-03 00:46:42         RAPIDO OCHOA  ESCALERA      25   \n","2    INTERNET  2023-04-23 00:41:29             BERLINAS       BUS      24   \n","3  PRESENCIAL  2024-06-15 20:21:37             BRASILIA       BUS      53   \n","4  PRESENCIAL  2024-02-03 03:28:20         RAPIDO OCHOA       BUS      39   \n","\n","       fecha_salida cuidad_destino  cliente_identifica  cliente_edad  \\\n","0  2023-11-08 07:04       MEDELLIN           407087792            52   \n","1  2024-10-16 02:35      CARTAGENA            99541189            74   \n","2  2023-05-18 04:36    BUCARAMANGA           110657387            79   \n","3  2024-07-13 12:24         BOGOTA            73835286            72   \n","4  2024-02-10 10:01      CARTAGENA           894524744            51   \n","\n","  cliente_sexo  cliente_equipaje ciudad_origen  \n","0       HOMBRE                 0  BARRANQUILLA  \n","1        MUJER                 2  BARRANQUILLA  \n","2       HOMBRE                 0  BARRANQUILLA  \n","3        MUJER                 3  BARRANQUILLA  \n","4       HOMBRE                 1  BARRANQUILLA  "],"text/html":["\n","  <div id=\"df-fff2b5b9-7c5e-45eb-a956-da7f5b97d041\" class=\"colab-df-container\">\n","    <div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>terminal_nit</th>\n","      <th>terminal_nombre</th>\n","      <th>ticket_id</th>\n","      <th>ticket_tipo</th>\n","      <th>fecha_venta</th>\n","      <th>empresa</th>\n","      <th>vehiculo</th>\n","      <th>puesto</th>\n","      <th>fecha_salida</th>\n","      <th>cuidad_destino</th>\n","      <th>cliente_identifica</th>\n","      <th>cliente_edad</th>\n","      <th>cliente_sexo</th>\n","      <th>cliente_equipaje</th>\n","      <th>ciudad_origen</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>800.123.456-7</td>\n","      <td>TERMINAL DE TRANSPORTE DE BARRANQUILLA</td>\n","      <td>79864565</td>\n","      <td>PRESENCIAL</td>\n","      <td>2023-10-20 09:34:54</td>\n","      <td>EXPRESO BOLIVARIANO</td>\n","      <td>MICROBUS</td>\n","      <td>7</td>\n","      <td>2023-11-08 07:04</td>\n","      <td>MEDELLIN</td>\n","      <td>407087792</td>\n","      <td>52</td>\n","      <td>HOMBRE</td>\n","      <td>0</td>\n","      <td>BARRANQUILLA</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>800.123.456-7</td>\n","      <td>TERMINAL DE TRANSPORTE DE BARRANQUILLA</td>\n","      <td>154754628</td>\n","      <td>INTERNET</td>\n","      <td>2024-10-03 00:46:42</td>\n","      <td>RAPIDO OCHOA</td>\n","      <td>ESCALERA</td>\n","      <td>25</td>\n","      <td>2024-10-16 02:35</td>\n","      <td>CARTAGENA</td>\n","      <td>99541189</td>\n","      <td>74</td>\n","      <td>MUJER</td>\n","      <td>2</td>\n","      <td>BARRANQUILLA</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>800.123.456-7</td>\n","      <td>TERMINAL DE TRANSPORTE DE BARRANQUILLA</td>\n","      <td>171325877</td>\n","      <td>INTERNET</td>\n","      <td>2023-04-23 00:41:29</td>\n","      <td>BERLINAS</td>\n","      <td>BUS</td>\n","      <td>24</td>\n","      <td>2023-05-18 04:36</td>\n","      <td>BUCARAMANGA</td>\n","      <td>110657387</td>\n","      <td>79</td>\n","      <td>HOMBRE</td>\n","      <td>0</td>\n","      <td>BARRANQUILLA</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>800.123.456-7</td>\n","      <td>TERMINAL DE TRANSPORTE DE BARRANQUILLA</td>\n","      <td>391438653</td>\n","      <td>PRESENCIAL</td>\n","      <td>2024-06-15 20:21:37</td>\n","      <td>BRASILIA</td>\n","      <td>BUS</td>\n","      <td>53</td>\n","      <td>2024-07-13 12:24</td>\n","      <td>BOGOTA</td>\n","      <td>73835286</td>\n","      <td>72</td>\n","      <td>MUJER</td>\n","      <td>3</td>\n","      <td>BARRANQUILLA</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>800.123.456-7</td>\n","      <td>TERMINAL DE TRANSPORTE DE BARRANQUILLA</td>\n","      <td>411640288</td>\n","      <td>PRESENCIAL</td>\n","      <td>2024-02-03 03:28:20</td>\n","      <td>RAPIDO OCHOA</td>\n","      <td>BUS</td>\n","      <td>39</td>\n","      <td>2024-02-10 10:01</td>\n","      <td>CARTAGENA</td>\n","      <td>894524744</td>\n","      <td>51</td>\n","      <td>HOMBRE</td>\n","      <td>1</td>\n","      <td>BARRANQUILLA</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>\n","    <div class=\"colab-df-buttons\">\n","\n","  <div class=\"colab-df-container\">\n","    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-fff2b5b9-7c5e-45eb-a956-da7f5b97d041')\"\n","            title=\"Convert this dataframe to an interactive table.\"\n","            style=\"display:none;\">\n","\n","  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n","    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n","  </svg>\n","    </button>\n","\n","  <style>\n","    .colab-df-container {\n","      display:flex;\n","      gap: 12px;\n","    }\n","\n","    .colab-df-convert {\n","      background-color: #E8F0FE;\n","      border: none;\n","      border-radius: 50%;\n","      cursor: pointer;\n","      display: none;\n","      fill: #1967D2;\n","      height: 32px;\n","      padding: 0 0 0 0;\n","      width: 32px;\n","    }\n","\n","    .colab-df-convert:hover {\n","      background-color: #E2EBFA;\n","      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n","      fill: #174EA6;\n","    }\n","\n","    .colab-df-buttons div {\n","      margin-bottom: 4px;\n","    }\n","\n","    [theme=dark] .colab-df-convert {\n","      background-color: #3B4455;\n","      fill: #D2E3FC;\n","    }\n","\n","    [theme=dark] .colab-df-convert:hover {\n","      background-color: #434B5C;\n","      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n","      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n","      fill: #FFFFFF;\n","    }\n","  </style>\n","\n","    <script>\n","      const buttonEl =\n","        document.querySelector('#df-fff2b5b9-7c5e-45eb-a956-da7f5b97d041 button.colab-df-convert');\n","      buttonEl.style.display =\n","        google.colab.kernel.accessAllowed ? 'block' : 'none';\n","\n","      async function convertToInteractive(key) {\n","        const element = document.querySelector('#df-fff2b5b9-7c5e-45eb-a956-da7f5b97d041');\n","        const dataTable =\n","          await google.colab.kernel.invokeFunction('convertToInteractive',\n","                                                    [key], {});\n","        if (!dataTable) return;\n","\n","        const docLinkHtml = 'Like what you see? Visit the ' +\n","          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n","          + ' to learn more about interactive tables.';\n","        element.innerHTML = '';\n","        dataTable['output_type'] = 'display_data';\n","        await google.colab.output.renderOutput(dataTable, element);\n","        const docLink = document.createElement('div');\n","        docLink.innerHTML = docLinkHtml;\n","        element.appendChild(docLink);\n","      }\n","    </script>\n","  </div>\n","\n","\n","    <div id=\"df-66a5732d-003b-4774-ab74-a7dd11c21b36\">\n","      <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-66a5732d-003b-4774-ab74-a7dd11c21b36')\"\n","                title=\"Suggest charts\"\n","                style=\"display:none;\">\n","\n","<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n","     width=\"24px\">\n","    <g>\n","        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n","    </g>\n","</svg>\n","      </button>\n","\n","<style>\n","  .colab-df-quickchart {\n","      --bg-color: #E8F0FE;\n","      --fill-color: #1967D2;\n","      --hover-bg-color: #E2EBFA;\n","      --hover-fill-color: #174EA6;\n","      --disabled-fill-color: #AAA;\n","      --disabled-bg-color: #DDD;\n","  }\n","\n","  [theme=dark] .colab-df-quickchart {\n","      --bg-color: #3B4455;\n","      --fill-color: #D2E3FC;\n","      --hover-bg-color: #434B5C;\n","      --hover-fill-color: #FFFFFF;\n","      --disabled-bg-color: #3B4455;\n","      --disabled-fill-color: #666;\n","  }\n","\n","  .colab-df-quickchart {\n","    background-color: var(--bg-color);\n","    border: none;\n","    border-radius: 50%;\n","    cursor: pointer;\n","    display: none;\n","    fill: var(--fill-color);\n","    height: 32px;\n","    padding: 0;\n","    width: 32px;\n","  }\n","\n","  .colab-df-quickchart:hover {\n","    background-color: var(--hover-bg-color);\n","    box-shadow: 0 1px 2px rgba(60, 64, 67, 0.3), 0 1px 3px 1px rgba(60, 64, 67, 0.15);\n","    fill: var(--button-hover-fill-color);\n","  }\n","\n","  .colab-df-quickchart-complete:disabled,\n","  .colab-df-quickchart-complete:disabled:hover {\n","    background-color: var(--disabled-bg-color);\n","    fill: var(--disabled-fill-color);\n","    box-shadow: none;\n","  }\n","\n","  .colab-df-spinner {\n","    border: 2px solid var(--fill-color);\n","    border-color: transparent;\n","    border-bottom-color: var(--fill-color);\n","    animation:\n","      spin 1s steps(1) infinite;\n","  }\n","\n","  @keyframes spin {\n","    0% {\n","      border-color: transparent;\n","      border-bottom-color: var(--fill-color);\n","      border-left-color: var(--fill-color);\n","    }\n","    20% {\n","      border-color: transparent;\n","      border-left-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","    }\n","    30% {\n","      border-color: transparent;\n","      border-left-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","      border-right-color: var(--fill-color);\n","    }\n","    40% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","    }\n","    60% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","    }\n","    80% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","      border-bottom-color: var(--fill-color);\n","    }\n","    90% {\n","      border-color: transparent;\n","      border-bottom-color: var(--fill-color);\n","    }\n","  }\n","</style>\n","\n","      <script>\n","        async function quickchart(key) {\n","          const quickchartButtonEl =\n","            document.querySelector('#' + key + ' button');\n","          quickchartButtonEl.disabled = true;  // To prevent multiple clicks.\n","          quickchartButtonEl.classList.add('colab-df-spinner');\n","          try {\n","            const charts = await google.colab.kernel.invokeFunction(\n","                'suggestCharts', [key], {});\n","          } catch (error) {\n","            console.error('Error during call to suggestCharts:', error);\n","          }\n","          quickchartButtonEl.classList.remove('colab-df-spinner');\n","          quickchartButtonEl.classList.add('colab-df-quickchart-complete');\n","        }\n","        (() => {\n","          let quickchartButtonEl =\n","            document.querySelector('#df-66a5732d-003b-4774-ab74-a7dd11c21b36 button');\n","          quickchartButtonEl.style.display =\n","            google.colab.kernel.accessAllowed ? 'block' : 'none';\n","        })();\n","      </script>\n","    </div>\n","\n","    </div>\n","  </div>\n"],"application/vnd.google.colaboratory.intrinsic+json":{"type":"dataframe","summary":"{\n  \"name\": \"display(df\",\n  \"rows\": 5,\n  \"fields\": [\n    {\n      \"column\": \"terminal_nit\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 1,\n        \"samples\": [\n          \"800.123.456-7\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"terminal_nombre\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 1,\n        \"samples\": [\n          \"TERMINAL DE TRANSPORTE DE BARRANQUILLA\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"ticket_id\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 150003361,\n        \"min\": 79864565,\n        \"max\": 411640288,\n        \"num_unique_values\": 5,\n        \"samples\": [\n          154754628\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"ticket_tipo\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 2,\n        \"samples\": [\n          \"INTERNET\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"fecha_venta\",\n      \"properties\": {\n        \"dtype\": \"object\",\n        \"num_unique_values\": 5,\n        \"samples\": [\n          \"2024-10-03 00:46:42\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"empresa\",\n      \"properties\": {\n        \"dtype\": \"string\",\n        \"num_unique_values\": 4,\n        \"samples\": [\n          \"RAPIDO OCHOA\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"vehiculo\",\n      \"properties\": {\n        \"dtype\": \"string\",\n        \"num_unique_values\": 3,\n        \"samples\": [\n          \"MICROBUS\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"puesto\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 17,\n        \"min\": 7,\n        \"max\": 53,\n        \"num_unique_values\": 5,\n        \"samples\": [\n          25\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"fecha_salida\",\n      \"properties\": {\n        \"dtype\": \"object\",\n        \"num_unique_values\": 5,\n        \"samples\": [\n          \"2024-10-16 02:35\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"cuidad_destino\",\n      \"properties\": {\n        \"dtype\": \"string\",\n        \"num_unique_values\": 4,\n        \"samples\": [\n          \"CARTAGENA\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"cliente_identifica\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 350230368,\n        \"min\": 73835286,\n        \"max\": 894524744,\n        \"num_unique_values\": 5,\n        \"samples\": [\n          99541189\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"cliente_edad\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 13,\n        \"min\": 51,\n        \"max\": 79,\n        \"num_unique_values\": 5,\n        \"samples\": [\n          74\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"cliente_sexo\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 2,\n        \"samples\": [\n          \"MUJER\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"cliente_equipaje\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 1,\n        \"min\": 0,\n        \"max\": 3,\n        \"num_unique_values\": 4,\n        \"samples\": [\n          2\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"ciudad_origen\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 1,\n        \"samples\": [\n          \"BARRANQUILLA\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    }\n  ]\n}"}},"metadata":{}}]},{"cell_type":"code","source":["ciudades_unicas=set(df['ciudad_origen'].unique()) | set(df['cuidad_destino'].unique())\n","print(ciudades_unicas)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"Ql5eLq4Kgdxb","executionInfo":{"status":"ok","timestamp":1761263947723,"user_tz":300,"elapsed":33,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"5dc24a9a-0dee-4d06-ff93-00c17c77212c"},"execution_count":18,"outputs":[{"output_type":"stream","name":"stdout","text":["{'BARRANQUILLA', 'MEDELLIN', 'BUCARAMANGA', 'PASTO', 'BOGOTA', 'CUCUTA', 'POPAYAN', 'CALI', 'SANTA MARTA', 'CARTAGENA'}\n"]}]},{"cell_type":"code","source":["#crear la base para las relaciones (rutas A ciudad origen a ciudad destino)\n","rutas = df.groupby(['ciudad_origen','cuidad_destino']).agg({\n","    'ticket_id': 'count',\n","    'empresa':lambda x: list(x.unique()),\n","    'vehiculo':lambda x: list(x.unique())\n","}).reset_index()\n","print(\"Total de rutas \",len(rutas))\n","display(rutas.head(10))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":370},"id":"9ZDHur1Gg4Nj","executionInfo":{"status":"ok","timestamp":1761264219133,"user_tz":300,"elapsed":73,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"98bc8b01-9de7-417d-a646-ec50d885328f"},"execution_count":20,"outputs":[{"output_type":"stream","name":"stdout","text":["Total de rutas  40\n"]},{"output_type":"display_data","data":{"text/plain":["  ciudad_origen cuidad_destino  ticket_id  \\\n","0  BARRANQUILLA         BOGOTA       2167   \n","1  BARRANQUILLA    BUCARAMANGA       2227   \n","2  BARRANQUILLA           CALI       2204   \n","3  BARRANQUILLA      CARTAGENA       2225   \n","4  BARRANQUILLA         CUCUTA       2218   \n","5  BARRANQUILLA       MEDELLIN       2224   \n","6  BARRANQUILLA          PASTO       2174   \n","7  BARRANQUILLA        POPAYAN       2189   \n","8          CALI         BOGOTA       1705   \n","9          CALI    BUCARAMANGA       1734   \n","\n","                                             empresa  \\\n","0  [BRASILIA, COPETRAN, EXPRESO BOLIVARIANO, RAPI...   \n","1  [BERLINAS, COPETRAN, RAPIDO OCHOA, BRASILIA, E...   \n","2  [BRASILIA, RAPIDO OCHOA, BERLINAS, EXPRESO BOL...   \n","3  [RAPIDO OCHOA, BRASILIA, COPETRAN, BERLINAS, E...   \n","4  [EXPRESO BOLIVARIANO, BRASILIA, COPETRAN, RAPI...   \n","5  [EXPRESO BOLIVARIANO, BERLINAS, BRASILIA, COPE...   \n","6  [EXPRESO BOLIVARIANO, RAPIDO OCHOA, BRASILIA, ...   \n","7  [RAPIDO OCHOA, BRASILIA, COPETRAN, BERLINAS, E...   \n","8  [EXPRESO BOLIVARIANO, RAPIDO OCHOA, BERLINAS, ...   \n","9  [EXPRESO BOLIVARIANO, BERLINAS, BRASILIA, RAPI...   \n","\n","                    vehiculo  \n","0  [BUS, MICROBUS, ESCALERA]  \n","1  [BUS, MICROBUS, ESCALERA]  \n","2  [ESCALERA, MICROBUS, BUS]  \n","3  [ESCALERA, BUS, MICROBUS]  \n","4  [BUS, ESCALERA, MICROBUS]  \n","5  [MICROBUS, ESCALERA, BUS]  \n","6  [ESCALERA, BUS, MICROBUS]  \n","7  [MICROBUS, BUS, ESCALERA]  \n","8  [MICROBUS, ESCALERA, BUS]  \n","9  [ESCALERA, MICROBUS, BUS]  "],"text/html":["\n","  <div id=\"df-89a47d07-7b4a-4cfa-a9df-123d871e4b42\" class=\"colab-df-container\">\n","    <div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>ciudad_origen</th>\n","      <th>cuidad_destino</th>\n","      <th>ticket_id</th>\n","      <th>empresa</th>\n","      <th>vehiculo</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>BARRANQUILLA</td>\n","      <td>BOGOTA</td>\n","      <td>2167</td>\n","      <td>[BRASILIA, COPETRAN, EXPRESO BOLIVARIANO, RAPI...</td>\n","      <td>[BUS, MICROBUS, ESCALERA]</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>BARRANQUILLA</td>\n","      <td>BUCARAMANGA</td>\n","      <td>2227</td>\n","      <td>[BERLINAS, COPETRAN, RAPIDO OCHOA, BRASILIA, E...</td>\n","      <td>[BUS, MICROBUS, ESCALERA]</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>BARRANQUILLA</td>\n","      <td>CALI</td>\n","      <td>2204</td>\n","      <td>[BRASILIA, RAPIDO OCHOA, BERLINAS, EXPRESO BOL...</td>\n","      <td>[ESCALERA, MICROBUS, BUS]</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>BARRANQUILLA</td>\n","      <td>CARTAGENA</td>\n","      <td>2225</td>\n","      <td>[RAPIDO OCHOA, BRASILIA, COPETRAN, BERLINAS, E...</td>\n","      <td>[ESCALERA, BUS, MICROBUS]</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>BARRANQUILLA</td>\n","      <td>CUCUTA</td>\n","      <td>2218</td>\n","      <td>[EXPRESO BOLIVARIANO, BRASILIA, COPETRAN, RAPI...</td>\n","      <td>[BUS, ESCALERA, MICROBUS]</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>BARRANQUILLA</td>\n","      <td>MEDELLIN</td>\n","      <td>2224</td>\n","      <td>[EXPRESO BOLIVARIANO, BERLINAS, BRASILIA, COPE...</td>\n","      <td>[MICROBUS, ESCALERA, BUS]</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>BARRANQUILLA</td>\n","      <td>PASTO</td>\n","      <td>2174</td>\n","      <td>[EXPRESO BOLIVARIANO, RAPIDO OCHOA, BRASILIA, ...</td>\n","      <td>[ESCALERA, BUS, MICROBUS]</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>BARRANQUILLA</td>\n","      <td>POPAYAN</td>\n","      <td>2189</td>\n","      <td>[RAPIDO OCHOA, BRASILIA, COPETRAN, BERLINAS, E...</td>\n","      <td>[MICROBUS, BUS, ESCALERA]</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>CALI</td>\n","      <td>BOGOTA</td>\n","      <td>1705</td>\n","      <td>[EXPRESO BOLIVARIANO, RAPIDO OCHOA, BERLINAS, ...</td>\n","      <td>[MICROBUS, ESCALERA, BUS]</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>CALI</td>\n","      <td>BUCARAMANGA</td>\n","      <td>1734</td>\n","      <td>[EXPRESO BOLIVARIANO, BERLINAS, BRASILIA, RAPI...</td>\n","      <td>[ESCALERA, MICROBUS, BUS]</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>\n","    <div class=\"colab-df-buttons\">\n","\n","  <div class=\"colab-df-container\">\n","    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-89a47d07-7b4a-4cfa-a9df-123d871e4b42')\"\n","            title=\"Convert this dataframe to an interactive table.\"\n","            style=\"display:none;\">\n","\n","  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n","    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n","  </svg>\n","    </button>\n","\n","  <style>\n","    .colab-df-container {\n","      display:flex;\n","      gap: 12px;\n","    }\n","\n","    .colab-df-convert {\n","      background-color: #E8F0FE;\n","      border: none;\n","      border-radius: 50%;\n","      cursor: pointer;\n","      display: none;\n","      fill: #1967D2;\n","      height: 32px;\n","      padding: 0 0 0 0;\n","      width: 32px;\n","    }\n","\n","    .colab-df-convert:hover {\n","      background-color: #E2EBFA;\n","      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n","      fill: #174EA6;\n","    }\n","\n","    .colab-df-buttons div {\n","      margin-bottom: 4px;\n","    }\n","\n","    [theme=dark] .colab-df-convert {\n","      background-color: #3B4455;\n","      fill: #D2E3FC;\n","    }\n","\n","    [theme=dark] .colab-df-convert:hover {\n","      background-color: #434B5C;\n","      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n","      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n","      fill: #FFFFFF;\n","    }\n","  </style>\n","\n","    <script>\n","      const buttonEl =\n","        document.querySelector('#df-89a47d07-7b4a-4cfa-a9df-123d871e4b42 button.colab-df-convert');\n","      buttonEl.style.display =\n","        google.colab.kernel.accessAllowed ? 'block' : 'none';\n","\n","      async function convertToInteractive(key) {\n","        const element = document.querySelector('#df-89a47d07-7b4a-4cfa-a9df-123d871e4b42');\n","        const dataTable =\n","          await google.colab.kernel.invokeFunction('convertToInteractive',\n","                                                    [key], {});\n","        if (!dataTable) return;\n","\n","        const docLinkHtml = 'Like what you see? Visit the ' +\n","          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n","          + ' to learn more about interactive tables.';\n","        element.innerHTML = '';\n","        dataTable['output_type'] = 'display_data';\n","        await google.colab.output.renderOutput(dataTable, element);\n","        const docLink = document.createElement('div');\n","        docLink.innerHTML = docLinkHtml;\n","        element.appendChild(docLink);\n","      }\n","    </script>\n","  </div>\n","\n","\n","    <div id=\"df-053d8c03-b14f-459e-90ab-a912fb166c49\">\n","      <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-053d8c03-b14f-459e-90ab-a912fb166c49')\"\n","                title=\"Suggest charts\"\n","                style=\"display:none;\">\n","\n","<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n","     width=\"24px\">\n","    <g>\n","        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n","    </g>\n","</svg>\n","      </button>\n","\n","<style>\n","  .colab-df-quickchart {\n","      --bg-color: #E8F0FE;\n","      --fill-color: #1967D2;\n","      --hover-bg-color: #E2EBFA;\n","      --hover-fill-color: #174EA6;\n","      --disabled-fill-color: #AAA;\n","      --disabled-bg-color: #DDD;\n","  }\n","\n","  [theme=dark] .colab-df-quickchart {\n","      --bg-color: #3B4455;\n","      --fill-color: #D2E3FC;\n","      --hover-bg-color: #434B5C;\n","      --hover-fill-color: #FFFFFF;\n","      --disabled-bg-color: #3B4455;\n","      --disabled-fill-color: #666;\n","  }\n","\n","  .colab-df-quickchart {\n","    background-color: var(--bg-color);\n","    border: none;\n","    border-radius: 50%;\n","    cursor: pointer;\n","    display: none;\n","    fill: var(--fill-color);\n","    height: 32px;\n","    padding: 0;\n","    width: 32px;\n","  }\n","\n","  .colab-df-quickchart:hover {\n","    background-color: var(--hover-bg-color);\n","    box-shadow: 0 1px 2px rgba(60, 64, 67, 0.3), 0 1px 3px 1px rgba(60, 64, 67, 0.15);\n","    fill: var(--button-hover-fill-color);\n","  }\n","\n","  .colab-df-quickchart-complete:disabled,\n","  .colab-df-quickchart-complete:disabled:hover {\n","    background-color: var(--disabled-bg-color);\n","    fill: var(--disabled-fill-color);\n","    box-shadow: none;\n","  }\n","\n","  .colab-df-spinner {\n","    border: 2px solid var(--fill-color);\n","    border-color: transparent;\n","    border-bottom-color: var(--fill-color);\n","    animation:\n","      spin 1s steps(1) infinite;\n","  }\n","\n","  @keyframes spin {\n","    0% {\n","      border-color: transparent;\n","      border-bottom-color: var(--fill-color);\n","      border-left-color: var(--fill-color);\n","    }\n","    20% {\n","      border-color: transparent;\n","      border-left-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","    }\n","    30% {\n","      border-color: transparent;\n","      border-left-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","      border-right-color: var(--fill-color);\n","    }\n","    40% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","    }\n","    60% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","    }\n","    80% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","      border-bottom-color: var(--fill-color);\n","    }\n","    90% {\n","      border-color: transparent;\n","      border-bottom-color: var(--fill-color);\n","    }\n","  }\n","</style>\n","\n","      <script>\n","        async function quickchart(key) {\n","          const quickchartButtonEl =\n","            document.querySelector('#' + key + ' button');\n","          quickchartButtonEl.disabled = true;  // To prevent multiple clicks.\n","          quickchartButtonEl.classList.add('colab-df-spinner');\n","          try {\n","            const charts = await google.colab.kernel.invokeFunction(\n","                'suggestCharts', [key], {});\n","          } catch (error) {\n","            console.error('Error during call to suggestCharts:', error);\n","          }\n","          quickchartButtonEl.classList.remove('colab-df-spinner');\n","          quickchartButtonEl.classList.add('colab-df-quickchart-complete');\n","        }\n","        (() => {\n","          let quickchartButtonEl =\n","            document.querySelector('#df-053d8c03-b14f-459e-90ab-a912fb166c49 button');\n","          quickchartButtonEl.style.display =\n","            google.colab.kernel.accessAllowed ? 'block' : 'none';\n","        })();\n","      </script>\n","    </div>\n","\n","    </div>\n","  </div>\n"],"application/vnd.google.colaboratory.intrinsic+json":{"type":"dataframe","summary":"{\n  \"name\": \"display(rutas\",\n  \"rows\": 10,\n  \"fields\": [\n    {\n      \"column\": \"ciudad_origen\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 2,\n        \"samples\": [\n          \"CALI\",\n          \"BARRANQUILLA\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"cuidad_destino\",\n      \"properties\": {\n        \"dtype\": \"string\",\n        \"num_unique_values\": 8,\n        \"samples\": [\n          \"BUCARAMANGA\",\n          \"MEDELLIN\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"ticket_id\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 205,\n        \"min\": 1705,\n        \"max\": 2227,\n        \"num_unique_values\": 10,\n        \"samples\": [\n          1705,\n          2227\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"empresa\",\n      \"properties\": {\n        \"dtype\": \"object\",\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"vehiculo\",\n      \"properties\": {\n        \"dtype\": \"object\",\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    }\n  ]\n}"}},"metadata":{}}]},{"cell_type":"markdown","source":["### 4.1.1 creación de nodos"],"metadata":{"id":"32pNZzTOiJ09"}},{"cell_type":"code","source":["ciudades_unicas=set(df['ciudad_origen'].unique()) | set(df['cuidad_destino'].unique())\n","#print(ciudades_unicas)\n","for ciudad in ciudades_unicas:\n","  neo4j_conn.execute(\"\"\"\n","  MERGE (c:Ciudad {nombre: $nombre})\n","  \"\"\", {\"nombre\":ciudad})\n","  print(f\"nodo {ciudad} creado\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"DnbuM-NTiNd8","executionInfo":{"status":"ok","timestamp":1761264536366,"user_tz":300,"elapsed":983,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"d1f045f2-595d-4893-ddd5-86a88fc3f6b4"},"execution_count":23,"outputs":[{"output_type":"stream","name":"stdout","text":["nodo BARRANQUILLA creado\n","nodo MEDELLIN creado\n","nodo BUCARAMANGA creado\n","nodo PASTO creado\n","nodo BOGOTA creado\n","nodo CUCUTA creado\n","nodo POPAYAN creado\n","nodo CALI creado\n","nodo SANTA MARTA creado\n","nodo CARTAGENA creado\n"]}]},{"cell_type":"markdown","source":["### 4.1.2 creación de rutas"],"metadata":{"id":"au7fdgu8jJ5t"}},{"cell_type":"code","source":["rutas = df.groupby(['ciudad_origen','cuidad_destino']).agg({\n","    'ticket_id': 'count',\n","    'empresa':lambda x: list(x.unique()),\n","    'vehiculo':lambda x: list(x.unique())\n","}).reset_index()\n","rutas.columns = ['origen', 'destino', 'total_tickets', 'empresas', 'vehiculos']\n","for _,ruta in rutas.iterrows():\n","  neo4j_conn.execute(\"\"\"\n","  MATCH (origen:Ciudad {nombre: $origen})\n","  MATCH (destino:Ciudad {nombre: $destino})\n","  MERGE (origen)-[r:RUTA_A]->(destino)\n","  SET r.total_tickets = $total_tickets,\n","      r.empresas = $empresas,\n","      r.vehiculos = $vehiculos\n","  \"\"\",{\"origen\":ruta['origen'],\n","       \"destino\":ruta['destino'],\n","       \"total_tickets\":int(ruta['total_tickets']),\n","       \"empresas\":ruta['empresas'],\n","       \"vehiculos\":ruta['vehiculos']})\n","  print(f\"ruta {ruta['origen']} a {ruta['destino']} creada\")\n","print(\" total rutas creadas \",len(rutas))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"SdgwhT-AjPXU","executionInfo":{"status":"ok","timestamp":1761264962296,"user_tz":300,"elapsed":2910,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"fd64ac36-4bc5-4083-c949-9d6891be5cff"},"execution_count":24,"outputs":[{"output_type":"stream","name":"stdout","text":["ruta BARRANQUILLA a BOGOTA creada\n","ruta BARRANQUILLA a BUCARAMANGA creada\n","ruta BARRANQUILLA a CALI creada\n","ruta BARRANQUILLA a CARTAGENA creada\n","ruta BARRANQUILLA a CUCUTA creada\n","ruta BARRANQUILLA a MEDELLIN creada\n","ruta BARRANQUILLA a PASTO creada\n","ruta BARRANQUILLA a POPAYAN creada\n","ruta CALI a BOGOTA creada\n","ruta CALI a BUCARAMANGA creada\n","ruta CALI a CALI creada\n","ruta CALI a CARTAGENA creada\n","ruta CALI a CUCUTA creada\n","ruta CALI a MEDELLIN creada\n","ruta CALI a PASTO creada\n","ruta CALI a POPAYAN creada\n","ruta CARTAGENA a BOGOTA creada\n","ruta CARTAGENA a BUCARAMANGA creada\n","ruta CARTAGENA a CALI creada\n","ruta CARTAGENA a CARTAGENA creada\n","ruta CARTAGENA a CUCUTA creada\n","ruta CARTAGENA a MEDELLIN creada\n","ruta CARTAGENA a PASTO creada\n","ruta CARTAGENA a POPAYAN creada\n","ruta MEDELLIN a BOGOTA creada\n","ruta MEDELLIN a BUCARAMANGA creada\n","ruta MEDELLIN a CALI creada\n","ruta MEDELLIN a CARTAGENA creada\n","ruta MEDELLIN a CUCUTA creada\n","ruta MEDELLIN a MEDELLIN creada\n","ruta MEDELLIN a PASTO creada\n","ruta MEDELLIN a POPAYAN creada\n","ruta SANTA MARTA a BOGOTA creada\n","ruta SANTA MARTA a BUCARAMANGA creada\n","ruta SANTA MARTA a CALI creada\n","ruta SANTA MARTA a CARTAGENA creada\n","ruta SANTA MARTA a CUCUTA creada\n","ruta SANTA MARTA a MEDELLIN creada\n","ruta SANTA MARTA a PASTO creada\n","ruta SANTA MARTA a POPAYAN creada\n"," total rutas creadas  40\n"]}]},{"cell_type":"markdown","source":["### 4.1.3 Consultas y análisis"],"metadata":{"id":"YZE593s2k-j0"}},{"cell_type":"code","source":["# top 5 de las rutas más populares (mueven más personas)"],"metadata":{"id":"D8XfqsoNlE3f"},"execution_count":null,"outputs":[]},{"cell_type":"code","source":["resultado = neo4j_conn.query(\"\"\"\n","MATCH (origen:Ciudad)-[r:RUTA_A]->(destino:Ciudad)\n","RETURN origen.nombre AS origen,\n","       destino.nombre AS destino,\n","       r.total_tickets as total_tickets\n","ORDER BY r.total_tickets DESC\n","LIMIT 5\n","\"\"\")\n","for i, ruta in enumerate(resultado):\n","  print(f\"{i+1}. {ruta['origen']} a {ruta['destino']} con {ruta['total_tickets']} tickets\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"XGZyNLv2lQIF","executionInfo":{"status":"ok","timestamp":1761265293479,"user_tz":300,"elapsed":261,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"7399ec47-a9f0-4675-8088-356c477cc6d6"},"execution_count":26,"outputs":[{"output_type":"stream","name":"stdout","text":["1. BARRANQUILLA a BUCARAMANGA con 2227 tickets\n","2. BARRANQUILLA a CARTAGENA con 2225 tickets\n","3. BARRANQUILLA a MEDELLIN con 2224 tickets\n","4. BARRANQUILLA a CUCUTA con 2218 tickets\n","5. MEDELLIN a PASTO con 2212 tickets\n"]}]},{"cell_type":"code","source":["# ciudades más conectadas (hubs)\n","resultado = neo4j_conn.query(\"\"\"\n","MATCH (c:Ciudad)-[r:RUTA_A]->()\n","RETURN c.nombre AS ciudad,\n","       COUNT(r) AS conexiones_de_salida,\n","       sum(r.total_tickets) as total_pasajeros\n","ORDER BY conexiones_de_salida DESC, total_pasajeros DESC\n","LIMIT 5\n","\"\"\")\n","for i, ruta in enumerate(resultado):\n","  print(f\"{i+1}. {ruta['ciudad']} con {ruta['conexiones_de_salida']} conexiones de salida y {ruta['total_pasajeros']} pasajeros\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"1VIP5n9MmQAl","executionInfo":{"status":"ok","timestamp":1761265693650,"user_tz":300,"elapsed":516,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"fa26b811-660d-4133-c3aa-a3628b1f40dc"},"execution_count":29,"outputs":[{"output_type":"stream","name":"stdout","text":["1. BARRANQUILLA con 8 conexiones de salida y 17628 pasajeros\n","2. MEDELLIN con 8 conexiones de salida y 16881 pasajeros\n","3. CARTAGENA con 8 conexiones de salida y 14096 pasajeros\n","4. SANTA MARTA con 8 conexiones de salida y 14093 pasajeros\n","5. CALI con 8 conexiones de salida y 13555 pasajeros\n"]}]},{"cell_type":"markdown","source":["### 4.1.4 Visuación de la red rutas"],"metadata":{"id":"zBzATWBfn6tD"}},{"cell_type":"code","source":["resultado = neo4j_conn.query(\"\"\"\n","MATCH (origen:Ciudad)-[r:RUTA_A]->(destino:Ciudad)\n","RETURN origen.nombre AS origen,\n","       destino.nombre AS destino,\n","       r.total_tickets as total_tickets\n","\"\"\")\n","net = Network(height='800px', width='100%', bgcolor='#1a1a1a', font_color='white')\n","net.barnes_hut(gravity=-8000, central_gravity=0.3, spring_length=200)\n","#agregar nodos y relaciones\n","for ruta in resultado:\n","  #nodos\n","  net.add_node(ruta['origen'], label=ruta['origen'], title=ruta['origen'],color='#FF6B35',size=30)\n","  net.add_node(ruta['destino'], label=ruta['destino'], title=ruta['destino'],color='#004E89', size=30)\n","\n","  #relacion entre nodos (el ancho es proporcional a los tickets vendidos)\n","  width= max(1,ruta['total_tickets']/100)\n","  net.add_edge(ruta['origen'], ruta['destino'], value=width,\n","               title=f\"{ruta['total_tickets']} tickets\", arrows='to')\n","#checkear que los nodos y las relaciones se crearan\n","if not net.get_nodes() and not net.get_edges():\n","  print(\"No se encontraron nodos o relaciones en la consulta\")\n","else:\n","  file_html='red_de_rutas.html'\n","  net.save_graph(file_html)\n","  #guarde el archivo en google colab\n","  with open(file_html, 'r') as f:\n","    html_content = f.read()\n","  with open(file_html, 'r', encoding='utf-8') as f:\n","    html_content = f.read()\n","  display(HTML(html_content))\n"],"metadata":{"id":"bpMRJ4oGoDTG"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["## 4.2.Análisis de comportamiento de los cliente\n","--\n","*  que segmento viaja más?\n","*  Cuales destinos son los favoritos/preferidos por un segmento?\n","*  Como varía el total de equipaje por segmento?"],"metadata":{"id":"4buzQ0XJvyoG"}},{"cell_type":"code","source":["#crear segmentos de edades\n","def clasificar_edad(edad):\n","  if edad<18:\n","    return \"MENOR\"\n","  elif edad<30:\n","    return \"J0VEN\"\n","  elif edad<50:\n","    return \"ADULTO\"\n","  elif edad<65:\n","    return \"ADULTO_MAYOR\"\n","  else:\n","    return \"TERCERA_EDAD\"\n","df['segmento_edad']=df['cliente_edad'].apply(clasificar_edad)\n","df['perfil']=df['segmento_edad']+'_'+df['cliente_sexo']\n","display(df.head())"],"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":486},"id":"SLvJ2o_VwZM4","executionInfo":{"status":"ok","timestamp":1761268540154,"user_tz":300,"elapsed":81,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"93c1d829-870a-4ed1-ad50-d32a22ec35eb"},"execution_count":36,"outputs":[{"output_type":"display_data","data":{"text/plain":["    terminal_nit                         terminal_nombre  ticket_id  \\\n","0  800.123.456-7  TERMINAL DE TRANSPORTE DE BARRANQUILLA   79864565   \n","1  800.123.456-7  TERMINAL DE TRANSPORTE DE BARRANQUILLA  154754628   \n","2  800.123.456-7  TERMINAL DE TRANSPORTE DE BARRANQUILLA  171325877   \n","3  800.123.456-7  TERMINAL DE TRANSPORTE DE BARRANQUILLA  391438653   \n","4  800.123.456-7  TERMINAL DE TRANSPORTE DE BARRANQUILLA  411640288   \n","\n","  ticket_tipo          fecha_venta              empresa  vehiculo  puesto  \\\n","0  PRESENCIAL  2023-10-20 09:34:54  EXPRESO BOLIVARIANO  MICROBUS       7   \n","1    INTERNET  2024-10-03 00:46:42         RAPIDO OCHOA  ESCALERA      25   \n","2    INTERNET  2023-04-23 00:41:29             BERLINAS       BUS      24   \n","3  PRESENCIAL  2024-06-15 20:21:37             BRASILIA       BUS      53   \n","4  PRESENCIAL  2024-02-03 03:28:20         RAPIDO OCHOA       BUS      39   \n","\n","       fecha_salida cuidad_destino  cliente_identifica  cliente_edad  \\\n","0  2023-11-08 07:04       MEDELLIN           407087792            52   \n","1  2024-10-16 02:35      CARTAGENA            99541189            74   \n","2  2023-05-18 04:36    BUCARAMANGA           110657387            79   \n","3  2024-07-13 12:24         BOGOTA            73835286            72   \n","4  2024-02-10 10:01      CARTAGENA           894524744            51   \n","\n","  cliente_sexo  cliente_equipaje ciudad_origen segmento_edad  \\\n","0       HOMBRE                 0  BARRANQUILLA  ADULTO_MAYOR   \n","1        MUJER                 2  BARRANQUILLA  TERCERA_EDAD   \n","2       HOMBRE                 0  BARRANQUILLA  TERCERA_EDAD   \n","3        MUJER                 3  BARRANQUILLA  TERCERA_EDAD   \n","4       HOMBRE                 1  BARRANQUILLA  ADULTO_MAYOR   \n","\n","                perfil  \n","0  ADULTO_MAYOR_HOMBRE  \n","1   TERCERA_EDAD_MUJER  \n","2  TERCERA_EDAD_HOMBRE  \n","3   TERCERA_EDAD_MUJER  \n","4  ADULTO_MAYOR_HOMBRE  "],"text/html":["\n","  <div id=\"df-f7a3d72b-6c25-4b7e-8a65-3c5318efaee4\" class=\"colab-df-container\">\n","    <div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>terminal_nit</th>\n","      <th>terminal_nombre</th>\n","      <th>ticket_id</th>\n","      <th>ticket_tipo</th>\n","      <th>fecha_venta</th>\n","      <th>empresa</th>\n","      <th>vehiculo</th>\n","      <th>puesto</th>\n","      <th>fecha_salida</th>\n","      <th>cuidad_destino</th>\n","      <th>cliente_identifica</th>\n","      <th>cliente_edad</th>\n","      <th>cliente_sexo</th>\n","      <th>cliente_equipaje</th>\n","      <th>ciudad_origen</th>\n","      <th>segmento_edad</th>\n","      <th>perfil</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>800.123.456-7</td>\n","      <td>TERMINAL DE TRANSPORTE DE BARRANQUILLA</td>\n","      <td>79864565</td>\n","      <td>PRESENCIAL</td>\n","      <td>2023-10-20 09:34:54</td>\n","      <td>EXPRESO BOLIVARIANO</td>\n","      <td>MICROBUS</td>\n","      <td>7</td>\n","      <td>2023-11-08 07:04</td>\n","      <td>MEDELLIN</td>\n","      <td>407087792</td>\n","      <td>52</td>\n","      <td>HOMBRE</td>\n","      <td>0</td>\n","      <td>BARRANQUILLA</td>\n","      <td>ADULTO_MAYOR</td>\n","      <td>ADULTO_MAYOR_HOMBRE</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>800.123.456-7</td>\n","      <td>TERMINAL DE TRANSPORTE DE BARRANQUILLA</td>\n","      <td>154754628</td>\n","      <td>INTERNET</td>\n","      <td>2024-10-03 00:46:42</td>\n","      <td>RAPIDO OCHOA</td>\n","      <td>ESCALERA</td>\n","      <td>25</td>\n","      <td>2024-10-16 02:35</td>\n","      <td>CARTAGENA</td>\n","      <td>99541189</td>\n","      <td>74</td>\n","      <td>MUJER</td>\n","      <td>2</td>\n","      <td>BARRANQUILLA</td>\n","      <td>TERCERA_EDAD</td>\n","      <td>TERCERA_EDAD_MUJER</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>800.123.456-7</td>\n","      <td>TERMINAL DE TRANSPORTE DE BARRANQUILLA</td>\n","      <td>171325877</td>\n","      <td>INTERNET</td>\n","      <td>2023-04-23 00:41:29</td>\n","      <td>BERLINAS</td>\n","      <td>BUS</td>\n","      <td>24</td>\n","      <td>2023-05-18 04:36</td>\n","      <td>BUCARAMANGA</td>\n","      <td>110657387</td>\n","      <td>79</td>\n","      <td>HOMBRE</td>\n","      <td>0</td>\n","      <td>BARRANQUILLA</td>\n","      <td>TERCERA_EDAD</td>\n","      <td>TERCERA_EDAD_HOMBRE</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>800.123.456-7</td>\n","      <td>TERMINAL DE TRANSPORTE DE BARRANQUILLA</td>\n","      <td>391438653</td>\n","      <td>PRESENCIAL</td>\n","      <td>2024-06-15 20:21:37</td>\n","      <td>BRASILIA</td>\n","      <td>BUS</td>\n","      <td>53</td>\n","      <td>2024-07-13 12:24</td>\n","      <td>BOGOTA</td>\n","      <td>73835286</td>\n","      <td>72</td>\n","      <td>MUJER</td>\n","      <td>3</td>\n","      <td>BARRANQUILLA</td>\n","      <td>TERCERA_EDAD</td>\n","      <td>TERCERA_EDAD_MUJER</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>800.123.456-7</td>\n","      <td>TERMINAL DE TRANSPORTE DE BARRANQUILLA</td>\n","      <td>411640288</td>\n","      <td>PRESENCIAL</td>\n","      <td>2024-02-03 03:28:20</td>\n","      <td>RAPIDO OCHOA</td>\n","      <td>BUS</td>\n","      <td>39</td>\n","      <td>2024-02-10 10:01</td>\n","      <td>CARTAGENA</td>\n","      <td>894524744</td>\n","      <td>51</td>\n","      <td>HOMBRE</td>\n","      <td>1</td>\n","      <td>BARRANQUILLA</td>\n","      <td>ADULTO_MAYOR</td>\n","      <td>ADULTO_MAYOR_HOMBRE</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>\n","    <div class=\"colab-df-buttons\">\n","\n","  <div class=\"colab-df-container\">\n","    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-f7a3d72b-6c25-4b7e-8a65-3c5318efaee4')\"\n","            title=\"Convert this dataframe to an interactive table.\"\n","            style=\"display:none;\">\n","\n","  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n","    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n","  </svg>\n","    </button>\n","\n","  <style>\n","    .colab-df-container {\n","      display:flex;\n","      gap: 12px;\n","    }\n","\n","    .colab-df-convert {\n","      background-color: #E8F0FE;\n","      border: none;\n","      border-radius: 50%;\n","      cursor: pointer;\n","      display: none;\n","      fill: #1967D2;\n","      height: 32px;\n","      padding: 0 0 0 0;\n","      width: 32px;\n","    }\n","\n","    .colab-df-convert:hover {\n","      background-color: #E2EBFA;\n","      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n","      fill: #174EA6;\n","    }\n","\n","    .colab-df-buttons div {\n","      margin-bottom: 4px;\n","    }\n","\n","    [theme=dark] .colab-df-convert {\n","      background-color: #3B4455;\n","      fill: #D2E3FC;\n","    }\n","\n","    [theme=dark] .colab-df-convert:hover {\n","      background-color: #434B5C;\n","      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n","      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n","      fill: #FFFFFF;\n","    }\n","  </style>\n","\n","    <script>\n","      const buttonEl =\n","        document.querySelector('#df-f7a3d72b-6c25-4b7e-8a65-3c5318efaee4 button.colab-df-convert');\n","      buttonEl.style.display =\n","        google.colab.kernel.accessAllowed ? 'block' : 'none';\n","\n","      async function convertToInteractive(key) {\n","        const element = document.querySelector('#df-f7a3d72b-6c25-4b7e-8a65-3c5318efaee4');\n","        const dataTable =\n","          await google.colab.kernel.invokeFunction('convertToInteractive',\n","                                                    [key], {});\n","        if (!dataTable) return;\n","\n","        const docLinkHtml = 'Like what you see? Visit the ' +\n","          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n","          + ' to learn more about interactive tables.';\n","        element.innerHTML = '';\n","        dataTable['output_type'] = 'display_data';\n","        await google.colab.output.renderOutput(dataTable, element);\n","        const docLink = document.createElement('div');\n","        docLink.innerHTML = docLinkHtml;\n","        element.appendChild(docLink);\n","      }\n","    </script>\n","  </div>\n","\n","\n","    <div id=\"df-17be2bb6-cc89-42d3-a03b-efe2dbc345d7\">\n","      <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-17be2bb6-cc89-42d3-a03b-efe2dbc345d7')\"\n","                title=\"Suggest charts\"\n","                style=\"display:none;\">\n","\n","<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n","     width=\"24px\">\n","    <g>\n","        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n","    </g>\n","</svg>\n","      </button>\n","\n","<style>\n","  .colab-df-quickchart {\n","      --bg-color: #E8F0FE;\n","      --fill-color: #1967D2;\n","      --hover-bg-color: #E2EBFA;\n","      --hover-fill-color: #174EA6;\n","      --disabled-fill-color: #AAA;\n","      --disabled-bg-color: #DDD;\n","  }\n","\n","  [theme=dark] .colab-df-quickchart {\n","      --bg-color: #3B4455;\n","      --fill-color: #D2E3FC;\n","      --hover-bg-color: #434B5C;\n","      --hover-fill-color: #FFFFFF;\n","      --disabled-bg-color: #3B4455;\n","      --disabled-fill-color: #666;\n","  }\n","\n","  .colab-df-quickchart {\n","    background-color: var(--bg-color);\n","    border: none;\n","    border-radius: 50%;\n","    cursor: pointer;\n","    display: none;\n","    fill: var(--fill-color);\n","    height: 32px;\n","    padding: 0;\n","    width: 32px;\n","  }\n","\n","  .colab-df-quickchart:hover {\n","    background-color: var(--hover-bg-color);\n","    box-shadow: 0 1px 2px rgba(60, 64, 67, 0.3), 0 1px 3px 1px rgba(60, 64, 67, 0.15);\n","    fill: var(--button-hover-fill-color);\n","  }\n","\n","  .colab-df-quickchart-complete:disabled,\n","  .colab-df-quickchart-complete:disabled:hover {\n","    background-color: var(--disabled-bg-color);\n","    fill: var(--disabled-fill-color);\n","    box-shadow: none;\n","  }\n","\n","  .colab-df-spinner {\n","    border: 2px solid var(--fill-color);\n","    border-color: transparent;\n","    border-bottom-color: var(--fill-color);\n","    animation:\n","      spin 1s steps(1) infinite;\n","  }\n","\n","  @keyframes spin {\n","    0% {\n","      border-color: transparent;\n","      border-bottom-color: var(--fill-color);\n","      border-left-color: var(--fill-color);\n","    }\n","    20% {\n","      border-color: transparent;\n","      border-left-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","    }\n","    30% {\n","      border-color: transparent;\n","      border-left-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","      border-right-color: var(--fill-color);\n","    }\n","    40% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","      border-top-color: var(--fill-color);\n","    }\n","    60% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","    }\n","    80% {\n","      border-color: transparent;\n","      border-right-color: var(--fill-color);\n","      border-bottom-color: var(--fill-color);\n","    }\n","    90% {\n","      border-color: transparent;\n","      border-bottom-color: var(--fill-color);\n","    }\n","  }\n","</style>\n","\n","      <script>\n","        async function quickchart(key) {\n","          const quickchartButtonEl =\n","            document.querySelector('#' + key + ' button');\n","          quickchartButtonEl.disabled = true;  // To prevent multiple clicks.\n","          quickchartButtonEl.classList.add('colab-df-spinner');\n","          try {\n","            const charts = await google.colab.kernel.invokeFunction(\n","                'suggestCharts', [key], {});\n","          } catch (error) {\n","            console.error('Error during call to suggestCharts:', error);\n","          }\n","          quickchartButtonEl.classList.remove('colab-df-spinner');\n","          quickchartButtonEl.classList.add('colab-df-quickchart-complete');\n","        }\n","        (() => {\n","          let quickchartButtonEl =\n","            document.querySelector('#df-17be2bb6-cc89-42d3-a03b-efe2dbc345d7 button');\n","          quickchartButtonEl.style.display =\n","            google.colab.kernel.accessAllowed ? 'block' : 'none';\n","        })();\n","      </script>\n","    </div>\n","\n","    </div>\n","  </div>\n"],"application/vnd.google.colaboratory.intrinsic+json":{"type":"dataframe","summary":"{\n  \"name\": \"display(df\",\n  \"rows\": 5,\n  \"fields\": [\n    {\n      \"column\": \"terminal_nit\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 1,\n        \"samples\": [\n          \"800.123.456-7\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"terminal_nombre\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 1,\n        \"samples\": [\n          \"TERMINAL DE TRANSPORTE DE BARRANQUILLA\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"ticket_id\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 150003361,\n        \"min\": 79864565,\n        \"max\": 411640288,\n        \"num_unique_values\": 5,\n        \"samples\": [\n          154754628\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"ticket_tipo\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 2,\n        \"samples\": [\n          \"INTERNET\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"fecha_venta\",\n      \"properties\": {\n        \"dtype\": \"object\",\n        \"num_unique_values\": 5,\n        \"samples\": [\n          \"2024-10-03 00:46:42\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"empresa\",\n      \"properties\": {\n        \"dtype\": \"string\",\n        \"num_unique_values\": 4,\n        \"samples\": [\n          \"RAPIDO OCHOA\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"vehiculo\",\n      \"properties\": {\n        \"dtype\": \"string\",\n        \"num_unique_values\": 3,\n        \"samples\": [\n          \"MICROBUS\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"puesto\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 17,\n        \"min\": 7,\n        \"max\": 53,\n        \"num_unique_values\": 5,\n        \"samples\": [\n          25\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"fecha_salida\",\n      \"properties\": {\n        \"dtype\": \"object\",\n        \"num_unique_values\": 5,\n        \"samples\": [\n          \"2024-10-16 02:35\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"cuidad_destino\",\n      \"properties\": {\n        \"dtype\": \"string\",\n        \"num_unique_values\": 4,\n        \"samples\": [\n          \"CARTAGENA\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"cliente_identifica\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 350230368,\n        \"min\": 73835286,\n        \"max\": 894524744,\n        \"num_unique_values\": 5,\n        \"samples\": [\n          99541189\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"cliente_edad\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 13,\n        \"min\": 51,\n        \"max\": 79,\n        \"num_unique_values\": 5,\n        \"samples\": [\n          74\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"cliente_sexo\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 2,\n        \"samples\": [\n          \"MUJER\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"cliente_equipaje\",\n      \"properties\": {\n        \"dtype\": \"number\",\n        \"std\": 1,\n        \"min\": 0,\n        \"max\": 3,\n        \"num_unique_values\": 4,\n        \"samples\": [\n          2\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"ciudad_origen\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 1,\n        \"samples\": [\n          \"BARRANQUILLA\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"segmento_edad\",\n      \"properties\": {\n        \"dtype\": \"category\",\n        \"num_unique_values\": 2,\n        \"samples\": [\n          \"TERCERA_EDAD\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    },\n    {\n      \"column\": \"perfil\",\n      \"properties\": {\n        \"dtype\": \"string\",\n        \"num_unique_values\": 3,\n        \"samples\": [\n          \"ADULTO_MAYOR_HOMBRE\"\n        ],\n        \"semantic_type\": \"\",\n        \"description\": \"\"\n      }\n    }\n  ]\n}"}},"metadata":{}}]},{"cell_type":"code","source":["#crear nodos por perfiles\n","perfiles_unicos= df['perfil'].unique()\n","for perfil in perfiles_unicos:\n","  partes = perfil.split(\"_\")\n","  if len(partes) >= 2:\n","    segmento = \"_\".join(partes[:-1])\n","    sexo = partes[-1]\n","    neo4j_conn.execute(\"\"\"\n","    MERGE (p:PerfilCliente {id: $id})\n","    SET p.segmento_edad = $segmento,\n","        p.sexo = $sexo\n","    \"\"\", {\"id\":perfil, \"segmento\":segmento, \"sexo\":sexo})\n","  print(f\"nodo {perfil} creado\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ed5xW2s7xd38","executionInfo":{"status":"ok","timestamp":1761268656026,"user_tz":300,"elapsed":576,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"521f1cac-4e3a-4758-a66b-bb4a0c2e5e34"},"execution_count":37,"outputs":[{"output_type":"stream","name":"stdout","text":["nodo ADULTO_MAYOR_HOMBRE creado\n","nodo TERCERA_EDAD_MUJER creado\n","nodo TERCERA_EDAD_HOMBRE creado\n","nodo ADULTO_HOMBRE creado\n","nodo J0VEN_MUJER creado\n","nodo ADULTO_MUJER creado\n","nodo ADULTO_MAYOR_MUJER creado\n","nodo J0VEN_HOMBRE creado\n"]}]},{"cell_type":"code","source":["import json\n","\n","#agregar datos de los viajes y el destino\n","viajes_perfil = df.groupby(['perfil','cuidad_destino']).agg({\n","    'ticket_id': 'count',\n","    'cliente_equipaje': 'mean',\n","    'ticket_tipo': lambda x: list(x.unique())\n","}).reset_index()\n","\n","viajes_perfil.columns = ['perfil', 'destino', 'total_viajes', 'promedio_equipaje','tipo_ticket']\n","\n","for _,vp in viajes_perfil.iterrows():\n","  neo4j_conn.execute(\"\"\"\n","  MATCH (p:PerfilCliente {id: $perfil})\n","  MATCH (c:Ciudad {nombre: $destino})\n","  MERGE (p)-[r:VIAJE_A]->(c)\n","  SET r.total_viajes = $total_viajes,\n","      r.equipaje_promedio = $promedio_equipaje,\n","      r.tipo_ticket = $tipo_ticket\n","  \"\"\",{\n","      \"perfil\":vp['perfil'],\n","      \"destino\":vp['destino'],\n","      \"total_viajes\":int(vp['total_viajes']),\n","      \"promedio_equipaje\":float(vp['promedio_equipaje']),\n","      \"tipo_ticket\":json.dumps(vp['tipo_ticket'])  #convierte una lista en un string json\n","  })\n","  print(f\"relación {vp['perfil']} a {vp['destino']} creada\")\n"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"1d5lDXfzy5Df","executionInfo":{"status":"ok","timestamp":1761269254656,"user_tz":300,"elapsed":3009,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"08d6f979-1ec7-4c97-f798-7860c1d53819"},"execution_count":39,"outputs":[{"output_type":"stream","name":"stdout","text":["relación ADULTO_HOMBRE a BOGOTA creada\n","relación ADULTO_HOMBRE a BUCARAMANGA creada\n","relación ADULTO_HOMBRE a CALI creada\n","relación ADULTO_HOMBRE a CARTAGENA creada\n","relación ADULTO_HOMBRE a CUCUTA creada\n","relación ADULTO_HOMBRE a MEDELLIN creada\n","relación ADULTO_HOMBRE a PASTO creada\n","relación ADULTO_HOMBRE a POPAYAN creada\n","relación ADULTO_MAYOR_HOMBRE a BOGOTA creada\n","relación ADULTO_MAYOR_HOMBRE a BUCARAMANGA creada\n","relación ADULTO_MAYOR_HOMBRE a CALI creada\n","relación ADULTO_MAYOR_HOMBRE a CARTAGENA creada\n","relación ADULTO_MAYOR_HOMBRE a CUCUTA creada\n","relación ADULTO_MAYOR_HOMBRE a MEDELLIN creada\n","relación ADULTO_MAYOR_HOMBRE a PASTO creada\n","relación ADULTO_MAYOR_HOMBRE a POPAYAN creada\n","relación ADULTO_MAYOR_MUJER a BOGOTA creada\n","relación ADULTO_MAYOR_MUJER a BUCARAMANGA creada\n","relación ADULTO_MAYOR_MUJER a CALI creada\n","relación ADULTO_MAYOR_MUJER a CARTAGENA creada\n","relación ADULTO_MAYOR_MUJER a CUCUTA creada\n","relación ADULTO_MAYOR_MUJER a MEDELLIN creada\n","relación ADULTO_MAYOR_MUJER a PASTO creada\n","relación ADULTO_MAYOR_MUJER a POPAYAN creada\n","relación ADULTO_MUJER a BOGOTA creada\n","relación ADULTO_MUJER a BUCARAMANGA creada\n","relación ADULTO_MUJER a CALI creada\n","relación ADULTO_MUJER a CARTAGENA creada\n","relación ADULTO_MUJER a CUCUTA creada\n","relación ADULTO_MUJER a MEDELLIN creada\n","relación ADULTO_MUJER a PASTO creada\n","relación ADULTO_MUJER a POPAYAN creada\n","relación J0VEN_HOMBRE a BOGOTA creada\n","relación J0VEN_HOMBRE a BUCARAMANGA creada\n","relación J0VEN_HOMBRE a CALI creada\n","relación J0VEN_HOMBRE a CARTAGENA creada\n","relación J0VEN_HOMBRE a CUCUTA creada\n","relación J0VEN_HOMBRE a MEDELLIN creada\n","relación J0VEN_HOMBRE a PASTO creada\n","relación J0VEN_HOMBRE a POPAYAN creada\n","relación J0VEN_MUJER a BOGOTA creada\n","relación J0VEN_MUJER a BUCARAMANGA creada\n","relación J0VEN_MUJER a CALI creada\n","relación J0VEN_MUJER a CARTAGENA creada\n","relación J0VEN_MUJER a CUCUTA creada\n","relación J0VEN_MUJER a MEDELLIN creada\n","relación J0VEN_MUJER a PASTO creada\n","relación J0VEN_MUJER a POPAYAN creada\n","relación TERCERA_EDAD_HOMBRE a BOGOTA creada\n","relación TERCERA_EDAD_HOMBRE a BUCARAMANGA creada\n","relación TERCERA_EDAD_HOMBRE a CALI creada\n","relación TERCERA_EDAD_HOMBRE a CARTAGENA creada\n","relación TERCERA_EDAD_HOMBRE a CUCUTA creada\n","relación TERCERA_EDAD_HOMBRE a MEDELLIN creada\n","relación TERCERA_EDAD_HOMBRE a PASTO creada\n","relación TERCERA_EDAD_HOMBRE a POPAYAN creada\n","relación TERCERA_EDAD_MUJER a BOGOTA creada\n","relación TERCERA_EDAD_MUJER a BUCARAMANGA creada\n","relación TERCERA_EDAD_MUJER a CALI creada\n","relación TERCERA_EDAD_MUJER a CARTAGENA creada\n","relación TERCERA_EDAD_MUJER a CUCUTA creada\n","relación TERCERA_EDAD_MUJER a MEDELLIN creada\n","relación TERCERA_EDAD_MUJER a PASTO creada\n","relación TERCERA_EDAD_MUJER a POPAYAN creada\n"]}]},{"cell_type":"markdown","source":["### 4.2.2 Análisis de los perfiles"],"metadata":{"id":"iyCGFYjU1K7O"}},{"cell_type":"code","source":["#perfiles que más viajaron\n","resultado = neo4j_conn.query(\"\"\"\n","MATCH (p:PerfilCliente)-[r:VIAJE_A]->()\n","RETURN p.segmento_edad AS segmento,\n","p.sexo AS sexo,\n","sum(r.total_viajes) AS total_viajes,\n","avg(r.equipaje_promedio) AS promedio\n","ORDER BY total_viajes DESC\n","LIMIT 10\n","\"\"\")\n","for i, perfil in enumerate(resultado):\n","  print(f\"{i+1}. Segmento: {perfil['segmento']}, Sexo: {perfil['sexo']}, Total Viajes: {perfil['total_viajes']}, Promedio Equipaje: {perfil['promedio']}\")\n"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"vpRabxAK1Pj3","executionInfo":{"status":"ok","timestamp":1761269433577,"user_tz":300,"elapsed":285,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"6ec02668-26a9-4949-ff27-c3cf72842edd"},"execution_count":40,"outputs":[{"output_type":"stream","name":"stdout","text":["1. Segmento: ADULTO, Sexo: HOMBRE, Total Viajes: 12137, Promedio Equipaje: 1.5124587894018384\n","2. Segmento: ADULTO, Sexo: MUJER, Total Viajes: 12133, Promedio Equipaje: 1.5072354154734626\n","3. Segmento: TERCERA_EDAD, Sexo: MUJER, Total Viajes: 9731, Promedio Equipaje: 1.5099402797591441\n","4. Segmento: TERCERA_EDAD, Sexo: HOMBRE, Total Viajes: 9617, Promedio Equipaje: 1.502847522170017\n","5. Segmento: ADULTO_MAYOR, Sexo: HOMBRE, Total Viajes: 9124, Promedio Equipaje: 1.483451599225087\n","6. Segmento: ADULTO_MAYOR, Sexo: MUJER, Total Viajes: 9054, Promedio Equipaje: 1.5032968542439087\n","7. Segmento: J0VEN, Sexo: MUJER, Total Viajes: 7289, Promedio Equipaje: 1.491354240502393\n","8. Segmento: J0VEN, Sexo: HOMBRE, Total Viajes: 7168, Promedio Equipaje: 1.5027164258336618\n"]}]},{"cell_type":"code","source":["#Destinos preferidos por segmengto\n","resultado = neo4j_conn.query(\"\"\"\n","MATCH (p:PerfilCliente)-[r:VIAJE_A]->(c:Ciudad)\n","WITH p.segmento_edad AS segmento, c.nombre AS destino, sum(r.total_viajes) AS total_viajes\n","ORDER BY segmento, total_viajes DESC\n","WITH segmento, collect({destino:destino, total_viajes:total_viajes})[0] AS favorito\n","RETURN segmento, favorito.destino as destino_favorito, favorito.total_viajes as total_viajes\n","ORDER BY total_viajes DESC\n","\"\"\")\n","for i, perfil in enumerate(resultado):\n","  print(f\"{i+1}. Segmento: {perfil['segmento']},  Total Viajes: {perfil['total_viajes']}, Destino favorito: {perfil['destino_favorito']}\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"JIzEhBto15LP","executionInfo":{"status":"ok","timestamp":1761269947068,"user_tz":300,"elapsed":155,"user":{"displayName":"luis fernando castellanos guarin","userId":"16109028104353633806"}},"outputId":"faa963ca-29d0-479f-c765-d2412225fb0a"},"execution_count":45,"outputs":[{"output_type":"stream","name":"stdout","text":["1. Segmento: ADULTO,  Total Viajes: 3103, Destino favorito: CUCUTA\n","2. Segmento: TERCERA_EDAD,  Total Viajes: 2456, Destino favorito: CARTAGENA\n","3. Segmento: ADULTO_MAYOR,  Total Viajes: 2357, Destino favorito: MEDELLIN\n","4. Segmento: J0VEN,  Total Viajes: 1941, Destino favorito: BUCARAMANGA\n"]}]},{"cell_type":"markdown","source":["#"],"metadata":{"id":"FeOTATSadmAL"}}]}